#Область ПрограммныйИнтерфейс

Процедура ВКМ_ТГУведомление () Экспорт
	HTTPСоединение = Новый HTTPСоединение ("api.telegram.org", 443, , , , 30, Новый ЗащищенноеСоединениеOpenSSL());
	ДанныеДляЗапроса = "bot" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	 
	Запрос = Новый Запрос;
	 
	Запрос.Текст = "ВЫБРАТЬ
	 |	ВКМ_УведомленияТелеграмБоту.Ссылка,
	 |	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения
	 |ИЗ
	 |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	Результат = Запрос.Выполнить().Выбрать();
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();
	
	Пока Результат.Следующий() Цикл
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("chat_id");
		ЗаписьJSON.ЗаписатьЗначение(ИдентификаторГруппыДляОповещения);
		ЗаписьJSON.ЗаписатьИмяСвойства("text");
		ЗаписьJSON.ЗаписатьЗначение(Результат.ВКМ_ТекстСообщения);
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		СтрокаJSON = ЗаписьJSON.Закрыть();
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;

	КонецЦикла;


КонецПроцедуры

#КонецОбласти
