#Область ПрограммныйИнтерфейс

Процедура ВКМ_ТГУведомление () Экспорт
	HTTPСоединение = Новый HTTPСоединение ("api.telegram.org", 443, , , , , , Новый ЗащищенноеСоединениеOpenSSL);
	ДанныеДляЗапроса = "bot8211311141:AAETVdKanHnR-HS62joiDLVEyW_TJ_WVmoY" + Константы.ВКМ_ТокенУправленияТелеграмБотом.Получить() + "/sendMessage";
	HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапроса);
	
	 HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	 
	 Запрос = Новый Запрос;
	 
	 Запрос.Текст = "ВЫБРАТЬ
	 |	ВКМ_УведомленияТелеграмБоту.Ссылка,
	 |	ВКМ_УведомленияТелеграмБоту.ВКМ_ТекстСообщения
	 |ИЗ
	 |	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	 Результат = Запрос.Выполнить().Выбрать();
	 ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить()
	
	Пока Результат.Следующий() Цикл
	Сообщение = Новый Структура;
	Сообщение.Вставить("chat_id",ИдентификаторГруппыДляОповещения);
	Сообщение.Вставить("text",Результат.Текст);
	СтрокаJSON = СтрокаJSON(Сообщение);
	HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
	HTTPОтвет = HTTPСоединение.Получить(HTTPЗапрос);
		Если HTTPОтвет.КодСостояния = 200 Тогда
			ДокОбъект = Результат.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
		КонецЕсли;

	КонецЦикла;


КонецПроцедуры

#КонецОбласти
