#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Сообщение = "";
	
	Если ЭтоНовый() Тогда 
		Сообщение = "Создан новый документ Обслуживание Клиентов";	
	КонецЕсли;
	

	Если Не ЭтоНовый() Тогда 
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка
		|"; 

		Запрос.УстановитьПараметр("Ссылка", Ссылка); 

		Результат = Запрос.Выполнить(); 
		Выборка = Результат.Выбрать(); 
		
		Пока Выборка.Следующий() Цикл 
			ДатаДокумента = Выборка.Дата; 
			СпециалистДок = Выборка.Специалист;
			
			Если ДатаДокумента <> Дата Тогда 
				Сообщение = "Дата или время изменены";
			КонецЕсли; 
		
			Если СпециалистДок <> Специалист Тогда
				Сообщение = "Выбран Специалист"
			КонецЕсли; 
			
		КонецЦикла; 
	КонецЕсли;
	
	Если НЕ Сообщение = "" Тогда
		НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
		НовыйЭлемент.ВКМ_ТекстСообщения = Сообщение;
		НовыйЭлемент.Записать();
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	ЗапросПоДоговору = Новый Запрос;
	ЗапросПоДоговору.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК Вид
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	ЗапросПоДоговору.УстановитьПараметр("Ссылка",Ссылка);
	ВыборДоговора = ЗапросПоДоговору.Выполнить().Выбрать();
	Пока ВыборДоговора.Следующий() Цикл
		Если НЕ ВыборДоговора.Вид = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			Отказ = Истина;
			ТекстСообщенияПользователю = "Выбран вид договора, отличный от АбонентскоеОбслуживание ";
			ОбщегоНазначения.СообщитьПользователю (ТекстСообщенияПользователю);
		КонецЕсли;  
	КонецЦикла;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияНачало КАК НачалоДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияКонец КАК КонецДействияДоговора,
	|	ВКМ_ОбслуживаниеКлиента.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
	|	ВКМ_ОбслуживаниеКлиента.Дата КАК ДатаДок
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.КонецДействияДоговора < Выборка.ДатаПроведенияРабот 
			ИЛИ Выборка.НачалоДействияДоговора > Выборка.ДатаПроведенияРабот 
			ИЛИ Выборка.КонецДействияДоговора < Выборка.ДатаДок 
			ИЛИ Выборка.НачалоДействияДоговора > Выборка.ДатаДок Тогда
				
			Отказ = Истина;
			Сообщение = "Дата договора не входит в период его действия";
			ОбщегоНазначения.СообщитьПользователю(Сообщение);
		КонецЕсли;
	КонецЦикла;
	

	Движения.ВКМ_ВыполненныеКлиентуРаботы.Очистить();
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.ВКМ_ВыполненныеКлиентуРаботы.Записать();
	
	Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Клиент = Клиент;
	Движение.Договор = Договор;
	

	Для Каждого ТекСтрокаУслуги из ВыполненныеРаботы Цикл
		Движение.КоличествоЧасов = ТекСтрокаУслуги.ФактическиПотраченоЧасов;
		Движение.СуммаКОплате = ТекСтрокаУслуги.ФактическиПотраченоЧасов * Договор.ВКМ_СтоимостьЧасаРаботы;
	КонецЦикла;
	
	// Движение по регистру ВКМ_ВыполненныеСотрудникомРаботы
	


	ПроцентОплатыОтРабот = ПолучитьПроцентОплатыОтРабот(Дата, Специалист);
	Если ПроцентОплатыОтРабот = Неопределено Тогда 
		
		ТекстСообщения = СтрШаблон("Документ не проведен. У сотрудника %1 не установлен процент оплаты от выполненных работ.", Специалист);	
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,Ссылка,,,Отказ);
		ВсегоЧасовКОплатеКлиенту = ВыполненныеРаботы.Итог("ЧасыКОплатеКлиенту");
	СтавкаЧасаПоДоговору = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"BKM_СтоимостьЧасаРаботыСпециалиста");
    СуммаКОплатеКлиенту = ВсегоЧасовКОплатеКлиенту * СтавкаЧасаПоДоговору;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Очистить();
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Движение = Движения.BKM_ВыполненныеСотрудникомРаботы.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Сотрудник = Специалист;
	Движение.ЧасовКОплате = ВыполненныеРаботы.Итог("ФактическиПотраченоЧасов");
	Движение.СуммаКОплате = СуммаКОплатеКлиенту * ПроцентОплатыОтРабот / 100;
	
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записать();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПроцентОплатыОтРабот (Дата,Специалист)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	BKM_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
	|ИЗ
	|	РегистрСведений.BKM_УсловияОплатыСотрудников.СрезПоследних(&ДатаДокумента, Сотрудник = &Сотрудник) КАК BKM_УсловияОплатыСотрудниковСрезПоследних";
	
	Запрос.УстановитьПараметр("ДатаДокумента", Дата);
	Запрос.УстановитьПараметр("Сотрудник", Специалист);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		
		Возврат Выборка.ПроцентОтРабот;
		
	Иначе   
		
		Возврат Неопределено; 
		
	КонецЕсли;
	
КонецФункции


#КонецОбласти