//Процедура ДополнитьФорму (Форма)
	//Реквизит = Форма.ИмяФормы;
	//НазваниеДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание;
	//Если (ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаСписка" 
	//И Справочники.ДоговорыКонтрагентов.НайтиПоРеквизиту("ВидДоговора",НазваниеДоговора) Тогда
	//ДобавитьРеквизитыНаФорму ();
//КонецПроцедуры

//Процедура ДобавитьРеквизитыНаФорму ()
	//ПолеВвода = Форма.Список.Добавить("ПериодДействия",Тип("ПолеФормы"),Форма
//КонецПроцедуры

	