// {{lg 19/09/2025 Задание 1 по дипломной работе "Работа с заявками клиентов"
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ДоговорыКонтрагентов.ВидДоговора
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка";
	//@skip-check undefined-variable
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Пока РезультатЗапроса.Следующий() Цикл
	Если РезультатЗапроса = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
ПериодДействияДоговора = Элементы.Добавить("ПериодДействияДоговора",Тип("ПолеФормы"),Элементы.Список);
ПериодДействияДоговора.ПутьКДанным = "Объект.ВКМ_ПериодДействия";
ПериодДействияДоговора.Вид = ВидПоляФормы.ПолеВвода;
ПериодДействияДоговора.Заголовок = "Период действия договора"; 

СуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),Элементы.Список);
СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
СуммаАбонентскойПлаты.Заголовок = "СуммаАбонентскойПлаты"; 	

СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),Элементы.Список);
СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";
КонецЕсли;
КонецЦикла;

КонецПроцедуры
#КонецОбласти
//}}lg