
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ВыполнитьАвтозаполнение() Экспорт
	
	НоменклатураАбонентскаяПлатаИзКонстанты = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	РаботыСпециалистаИзКонстанты = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	
	Если НоменклатураАбонентскаяПлатаИзКонстанты = Неопределено Тогда
		Сообщение1 = Новый СообщениеПользователю;
		Сообщение1.Текст = "Не заполнено значение константы НоменклатураАбонентскаяПлата";
		Сообщение1.Сообщить(); 	
		Возврат;
	КонецЕсли;
	
	Если РаботыСпециалистаИзКонстанты = Неопределено Тогда
		Сообщение2 = Новый СообщениеПользователю;
		Сообщение2.Текст = "Не заполнено значение константы НоменклатураРаботыСпециалиста";
		Сообщение2.Сообщить();
		Возврат; 	
	КонецЕсли;
	
	Товары.Очистить();
	Услуги.Очистить();
	ЕжемесячнаяПлата = Договор.ВКМ_СуммаАбонентскойПлаты;
	Если НЕ (ЕжемесячнаяПлата = 0) Тогда
	НоваяСтрока = Услуги.Добавить();
	НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлатаИзКонстанты;
	НоваяСтрока.Сумма = ЕжемесячнаяПлата;
	КонецЕсли; 
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.КоличествоЧасовОборот КАК Количество,
//	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.СуммаКОплатеОборот КАК Сумма,
//	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор КАК ДоговорВыполнение
//	|ИЗ
//	|	РегистрНакопления.ВКМ_ВыполненныеКлиентуРаботы.ОстаткиИОбороты(&НачалоМесяца, &КонецМесяца,,,) КАК
//	|		ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты
//	|ГДЕ
//	|	ВКМ_ВыполненныеКлиентуРаботыОстаткиИОбороты.Договор.Ссылка = &Ссылка";
//	Запрос.УстановитьПараметр("НачалоМесяца",НачалоМесяца(Дата));
//	Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца(Дата));
//	Запрос.УстановитьПараметр("Ссылка",Ссылка );
//	Выборка = Запрос.Выполнить().Выбрать();
//		Пока Выборка.Следующий() Цикл
//			Если НЕ (ЕжемесячнаяПлата = 0) Тогда
//				НоваяСтрока = Услуги.Добавить();
//				НоваяСтрока.Номенклатура = РаботыСпециалистаИзКонстанты;
//				НоваяСтрока.Количество = Выборка.Количество;
//				НоваяСтрока.Цена = ЕжемесячнаяПлата;
//				НоваяСтрока.Сумма = Выборка.Сумма;
//			КонецЕсли; 		
//		КонецЦикла;
//	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
