
&НаСервере
Процедура ЗаполнитьНаСервере()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(Период.ДатаНачала, Период.ДатаОкончания, ВыходныеДниПоДнямНедели, ГрафикРабот);	

КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	Если Не ЗначениеЗаполнено(ГрафикРабот) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("График работ не заполнен",,"ГрафикРабот");
		Возврат;
	Конецесли;
	
	Если Не ЗначениеЗаполнено(Период.ДатаНачала) Или Не ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Корректно заполните период",,"Период");
		Возврат;
	Конецесли;			
	
	ЗаполнитьНаСервере();
	ОбщегоНазначенияКлиент.СообщитьПользователю("Обработка заполнения графика завершена");

КонецПроцедуры
