// {{lg 19/09/2025 Задание 1 по дипломной работе "Работа с заявками клиентов"
#Область ОбработчикиСобытийФормы 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	
 Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	
	ПериодДействияДоговораНачало = Элементы.Добавить("ПериодДействияДоговораНачало",Тип("ПолеФормы"),ЭтотОбъект);
	ПериодДействияДоговораНачало.ПутьКДанным = "Объект.ВКМ_ПериодДействияНачало";
	ПериодДействияДоговораНачало.Вид = ВидПоляФормы.ПолеВвода;
	ПериодДействияДоговораНачало.Заголовок = "Дата начала действия договора"; 
	
	ПериодДействияДоговораКонец = Элементы.Добавить("ПериодДействияДоговораКонец",Тип("ПолеФормы"),ЭтотОбъект);
	ПериодДействияДоговораКонец.ПутьКДанным = "Объект.ВКМ_ПериодДействияКонец";
	ПериодДействияДоговораКонец.Вид = ВидПоляФормы.ПолеВвода;
	ПериодДействияДоговораКонец.Заголовок = "Дата окончания действия договора"; 
	
	СуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),ЭтотОбъект);
	СуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	СуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода;
	СуммаАбонентскойПлаты.Заголовок = "СуммаАбонентскойПлаты"; 	
	
	СтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),ЭтотОбъект);
	СтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	СтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода;
	СтоимостьЧасаРаботы.Заголовок = "Стоимость часа работы";	
КонецЕсли;

КонецПроцедуры

#КонецОбласти
//}}lg