//#Область ОбработчикиСобытийФормы
//
//&НаСервере
//Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
//	
//	// СтандартныеПодсистемы.ПодключаемыеКоманды
//	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
//	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
//
//КонецПроцедуры
//
//#КонецОбласти 
//
////@skip-check module-structure-top-region
//#Область ПодключаемыеКоманды
//
//// СтандартныеПодсистемы.ПодключаемыеКоманды
//&НаКлиенте
//Процедура Подключаемый_ВыполнитьКоманду(Команда)
//    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
//КонецПроцедуры
//
//&НаКлиенте
//Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
//    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
//КонецПроцедуры
//
//&НаСервере
//Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
//    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
//КонецПроцедуры
//
//&НаКлиенте
//Процедура Подключаемый_ОбновитьКоманды()
//    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
//КонецПроцедуры
//// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
//
//#КонецОбласти
